[
  {
    "name": [
      "Un-named Loch at base of Suilven"
    ],
    "description": [
      "A tough but rewarding 2 hour walk that takes you  past Fionn Loch up to the western foot of Suilven. Superb quality golden trout that can be shy but are generally of a big average size."
    ],
    "lat_lng": " 58.118918, -5.159500"
  },
  {
    "name": [
      "Fiddle Loch"
    ],
    "description": [
      "This rarely fished loch requires a 1 hour 15 minute walk from Inchnadamph. It holds trout of a reasonable average but stories of much larger fish having been seen abound."
    ],
    "lat_lng": " 58.172631, -4.943138"
  },
  {
    "name": [
      "Un-named Loch Little Green"
    ],
    "description": [
      "A testing hour and a half from the A894 road to Kyelsku, this is a small lochan known locally as 'Little Green' given its proximity to Lochan a Choire Ghuirm. A surprisingly large average size of fish for such a small water with much larger fish caught from year to year."
    ],
    "lat_lng": " 58.201995, -4.955783"
  },
  {
    "name": [
      "Lochan Fada"
    ],
    "description": [
      "An hour and fifteen minutes will bring you to this loch which lies beyond Cam Loch. Lots of free taking average fish, but reports of much larger fish are not uncommon."
    ],
    "lat_lng": " 58.102768, -5.047718"
  },
  {
    "name": [
      "Uidh Fhearna River between Loch Veyatie and Fionn Loch"
    ],
    "description": [
      "Between Grid References NC154155 & NC144162",
      "A broad river flowing from Loch Veyatie into Fionn Loch, measuring just over 1 km in length by about 40 metres wide in places. Lots of trout in this river with good numbers in the 1lb region and some larger ones. Access from Veyatie or Fionn."
    ],
    "lat_lng": " 58.089909, -5.133172"
  },
  {
    "name": [
      "River Between Loch Gainimh & Loch Druim Suardalain"
    ],
    "description": [
      "Between NC170194 & NC119218",
      "A small spate river between Loch Gainimh and Loch Druim Suardalain. Good sporting trout in average sizes with the odd bigger fish and some salmon a sea trout late in the season. The river has two names -Abhainn na Clach Airigh changing mids-tream to Abhainn bad na h-Achlaise."
    ],
    "lat_lng": " 58.125550, -5.109123"
  },
  {
    "name": [
      "Loch Fleodach Coire"
    ],
    "description": [
      "An hour and twenty minutes from Inchnadamph, this interesting trout loch is set high up with more average sized trout but with better ones being taken not infrequently."
    ],
    "lat_lng": " 58.178169, -4.936791"
  },
  {
    "name": [
      "Lochan Sgeireach"
    ],
    "description": [
      "Easily accessed from the viewpoint on the B869, this deep, clear, thin loch produces hard to catch but often large trout. Some exceptional fish have been taken here in recent years although it can take more than one visit to entice one to take!"
    ],
    "lat_lng": " 58.176085, -5.280263"
  },
  {
    "name": [
      "Loch Feith an Leothaid"
    ],
    "description": [
      "A rough 1½  hour walk from Little Assynt will bring you to this large hill loch. Baskets of free rising trout of varying average size are what it’s about here. A great day out."
    ],
    "lat_lng": " 58.153971, -5.086102"
  },
  {
    "name": [
      "Loch Druim Suardalain  (The Glen Loch)"
    ],
    "description": [
      "Boat ONLY at NC109218.",
      "Easily accessed from Lochinver and a very attractive water with Canisp and Suilven in the background, the Geln Loch has lots of average trout but also salmon and sea trout later in the season.\n"
    ],
    "lat_lng": " 58.144763, -5.204286"
  },
  {
    "name": [
      "Loch Beannach"
    ],
    "description": [
      "Boats (2) available at NC141262.",
      "Beannach is an easy 25 minute walk and has a vast population of wild brown trout, but also arctic char and a few salmon and sea trout - although neither of the latter have been reported caught in recent years. \n"
    ],
    "lat_lng": " 58.187971, -5.165633"
  },
  {
    "name": [
      "Loch Culag The School Loch"
    ],
    "description": [
      "Boat ONLY  fishing, located at NC097218",
      "Next to the road just south of Lochinver and home to the local school, Culag has both plenty of hard fighting trout and also migrating salmon and sea trout. Boat only fishing.\n"
    ],
    "lat_lng": " 58.143095, -5.234731"
  },
  {
    "name": [
      "Loch Bealach a Mhadaidh"
    ],
    "description": [
      "The trip to Loch Bealach a' Mhadaidh is not for the unfit, or faint-hearted requiring a walk of seven kilometres from Inchnadamph. All sizes of trout in here but evidently a very good head of bigger fish are present with baskets of these big fish being taken from time to time. It doesn't get fished that often due to it's location but it is one of the best lochs in the area. Although hardly ever caught, salmon can migrate there also."
    ],
    "lat_lng": " 58.165210, -4.874502"
  },
  {
    "name": [
      "Loch Bealach na h-Uidhe"
    ],
    "description": [
      "530 metres and 1½ hours up the mountain from Inchnadamph, this corrie loch is what trout fishing in Assynt is all about. Some cracking trout in there to put a good bend in the rod and all in a spectacular setting."
    ],
    "lat_lng": " 58.185850, -4.954441"
  },
  {
    "name": [
      "Loch Bad an Sluic"
    ],
    "description": [
      "Assynt Angling Group Southern Zone",
      "Small loch reachable by following the track from Loch Druim Suardalain up",
      "the hill behind Suileag bothy; or from the north by walking up from Little",
      "Assynt, via Loch an Leothaid and Loch Crom.  ",
      "Good population of wild brown trout mainly up to 1/2lb. ",
      "Boat available at 150217."
    ],
    "lat_lng": " 58.146325, -5.141533"
  },
  {
    "name": [
      "Loch Bad na Murichinn"
    ],
    "description": [
      "Head south out of Lochinver on the unmarked road toward Inverkirkaig. Once past Badnaban, park where the road turns a sharp right on a flat plateau and follow the burn up the gulley to Loch Bad na Murichinn (also known as the Children's Loch). It takes between 15-30 minutes, depending on your speed.",
      "There is a boat available which helps to explore the wooded southern shoreline as well as making it easier to cover the large water. ",
      " - ",
      "At the top right of the loch there is a gravel beach which is reputedly shallow enough for children to paddle in. The loch is locally known for small fish and according to local sources shown marked improvement in last 4 years with fish coming in at 12-14 ounces. Trout of mostly average size they can come to the fly readily when 'on' - try the south eastern tip from the shore for some sport - and there are larger fish in here. ",
      " said: “To be here and yet still be within half a mile of a road, makes you feel cut off, with peace and tranquility, absolutely perfect for picnics with scenery comparable with anywhere else within the area.”",
      "For the more adventurous, you can go on up from here to ",
      ", ",
      " and even Loch Uidh na Ceardaich up next to ",
      ". You won't be bored - all of these have lots of trout - but they are very much on the small size!"
    ],
    "lat_lng": " 58.127764, -5.236738"
  },
  {
    "name": [
      "Loch Awe"
    ],
    "description": [
      "A roadside loch which is popular and easily accessible with boat only fishing. It has a very good head of trout of decent average size but also has good numbers of larger fish in there too. A few salmon and sea trout enter the loch also, but are very rarely caught."
    ],
    "lat_lng": " 58.092712, -4.978973"
  },
  {
    "name": [
      "Loch an Ruighein"
    ],
    "description": [
      "Boat available at NC155266",
      "Known as the Sheiling Loch, this small water contains good numbers of lovely, silvery brownies that commonly average between 8-10ozs although fish well in excess of this weight are not uncommon.\n"
    ],
    "lat_lng": " 58.191291, -5.140399"
  },
  {
    "name": [
      "Loch an Alltain Duibh"
    ],
    "description": [
      "Small loch on the river below Suileag Bothy.  Plenty of small brown trout that respond well to a dry fly.",
      " This loch added by site user."
    ],
    "lat_lng": " 58.134958, -5.151398"
  },
  {
    "name": [
      "Loch an Leothaid"
    ],
    "description": [
      "Boat available at: 175294"
    ],
    "lat_lng": " 58.215441, -5.108472"
  },
  {
    "name": [
      "Loch Assynt"
    ],
    "description": [
      "The biggest loch in the area, 8kms long by 1.5km wide, with both bank and boat fishing available. Brown trout, ferox, arctic char, salmon and sea trout, with a huge head of averaged sized trout. Very much better fish inhabit the waters obviously too with the odd double figure monster being taken from time to time, so watch out with every cast. Dangerous in high winds but easily accessible."
    ],
    "lat_lng": " 58.175498, -5.050544"
  },
  {
    "name": [
      "Loch a Ghlinnen"
    ],
    "description": [
      "A beautiful loch en route to Loch Feith an Leothaid, Ghlinnen is home to a robust population of beautifully marked, hard fighting, pink fleshed, wild trout. There are some good trout lurking in the clear waters of this loch so always be prepared!"
    ],
    "lat_lng": " 58.161424, -5.112256"
  },
  {
    "name": [
      "Loch an Arbhair"
    ],
    "description": [
      "Boat available at: 078187"
    ],
    "lat_lng": " 58.115371, -5.264486"
  },
  {
    "name": [
      "Loch a Choire Dheirg (Red Corrie)"
    ],
    "description": [
      "A steep, one hour walk up from the A894 road to Kyelsku brings you to this dramatic loch. Known by the English 'Red Corrie', the crystal clear water has plenty of excellently sized trout in it, if slightly shy at times."
    ],
    "lat_lng": " 58.199767, -4.974322"
  },
  {
    "name": [
      "Loch a Choin (The Dog Loch)"
    ],
    "description": [
      "On the 'mad wee road' south from Lochinver, this is in easy reach of the road. Not many, but excellent quality trout reside here in clear water. 2.5lbs is a nice fish but there are much bigger fish undoubtedly about."
    ],
    "lat_lng": " 58.114735, -5.254237"
  },
  {
    "name": [
      "Fionn Loch"
    ],
    "description": [
      "Set in spectacular scenery at the foot of Suilven and at the top of the River Kirkaig, this 3.5km long loch holds a superb head of brown trout with pink flesh and arctic char. Good numbers of bigger than average trout taken with a few real lunkers taken each season."
    ],
    "lat_lng": " 58.109359, -5.182426"
  },
  {
    "name": [
      "Lochan Bealach Cornaidh"
    ],
    "description": [
      "Bealach a' Chornaidh separates the northern peak from the eastern ridge of Quinaig, set in the valley floor. Sometimes dour, it has silvery fish of good average size with much better fish being taken from time to time with the occasional 'dog' of a fish turning up in a fisher's basket!"
    ],
    "lat_lng": " 58.206033, -5.051463"
  },
  {
    "name": [
      "Loch Uidh na Geadaig"
    ],
    "description": [
      "Park by the river at NC143253 and head north across the road. Lots of small fish and can be the start of a walk onto ",
      " (which is best fished from a boat) and/or Loch Bad nan Aighean. ",
      " - ",
      "It is a short walk and across fairly flat land (a rarity for Assynt!). It can get boggy in places in wet weather but it is an easy and safe loch to get too. It has lots of small fish and easy for children to fish."
    ],
    "lat_lng": " 58.180026, -5.159822"
  },
  {
    "name": [
      "Loch Veyatie"
    ],
    "description": [
      "A long, thin, roadside loch with lots of trout of varying size. 30+ fish of average size per day is not uncommon but there are much better ones to be caught in there amongst them. Also has shoals of char and some ferox - some leviathans lurk here! \n"
    ],
    "lat_lng": " 58.063467, -5.037582"
  },
  {
    "name": [
      "Lochan a Choire Ghuirm (Green Corrie Lochs)"
    ],
    "description": [
      "One of the most renowned lochs in Assynt set in spectacular scenery, at 550m this is a stiff walk even for the fit. However, it can be worth the walk as the average size in this loch is very good indeed and there are much bigger ones in there too!  \n"
    ],
    "lat_lng": " 58.194780, -4.956885"
  },
  {
    "name": [
      "Cam Loch"
    ],
    "description": [
      "This is a large and easily accessible loch on the left of the A835 road from Ullapool, just before the Ledmore Junction. Lots of trout in here, mostly average in size with some larger specimens; also has char and ferox."
    ],
    "lat_lng": " 58.074270, -5.036805"
  },
  {
    "name": [
      "Loch na h-Innse Fraoich"
    ],
    "description": [
      " Leave the A837 near Loch Assynt Lodge. There is an all-abilities disabled access path to the loch, where there is an excellent boat, a jetty and boathouse and a toilet.",
      " - ",
      "This loch is part of the All Abilities walk developed by the Culag Community Woodland Trust (CCWT). It has a boat on it that has been made suitable for disabled access, changeable for left and right handed use and with the option to sit astride rather than only forward or back facing.",
      " is nearby and they make an excellent spot for families, with toilet facilities and is easily accessed. ",
      "Fraoich (the smaller of the two lochs) is particularly recommended as it fishes slightly better, and has great viewing points."
    ],
    "lat_lng": " 58.187141, -5.126419"
  },
  {
    "name": [
      "Loch na Faoileige (The Gull Loch)"
    ],
    "description": [
      "A tough hour and a half walk from the A837, Loch na Faoileige is a small loch in dramatic scenery with good numbers of nicely sized trout in it."
    ],
    "lat_lng": " 58.126412, -5.036149"
  },
  {
    "name": [
      "Loch na Beinne Reidhe"
    ],
    "description": [
      "An hour and a half from Inchnadamph, this loch contains fat trout of excellent average size to put a good bend in the rod. This combines a great loch with a great day out."
    ],
    "lat_lng": " 58.147041, -5.037908"
  },
  {
    "name": [
      "Loch Mhoalach-coire Loch Gillaroo"
    ],
    "description": [
      "Taking about an hour and a half to reach from the Inchnadamph car park and once known as The Gilaroo Loch, this is a relatively small loch with limestone bed. Historical catches of big fish over 5lbs are recorded and shown locally in glass cases in hotels and although the average is much more modest today you never know when the next big one could strike!"
    ],
    "lat_lng": " 58.130785, -4.926090"
  },
  {
    "name": [
      "Loch na Barrack"
    ],
    "description": [
      "A 7km/2 hour rough trek from Glencanisp will bring you to Loch Barrack and its immediate neighbour, Loch a Choire Dhuibh at the northwestern end of Suilven. Spectacular scenery, a chain of smaller lochans, and average sized golden trout with larger fish being taken commonly."
    ],
    "lat_lng": " 58.119629, -5.130687"
  },
  {
    "name": [
      "Loch Leitir Easidh"
    ],
    "description": [
      " Park at the car park at NC 172262 on the A837 just before Loch Assynt Lodge. There is an all-abilities disabled access path to the loch, where there is an excellent boat, a jetty and boathouse and a toilet.",
      " - ",
      "This loch is part of the All Abilities walk developed by the Culag Community Woodland Trust (CCWT).",
      "It has a boat on it that has been made suitable for disabled access, changeable for left and right handed use and with the option to sit astride rather than only forward or back facing.",
      "You can go on from here to Loch nah-Innse Fraoich which is nearby. It also makes an excellent spot for families, with toilet facilities at each loch and easily accessed."
    ],
    "lat_lng": " 58.188287, -5.116309"
  }
]
