[
{"name": ["The Manse Loch"], "description": ["The Manse loch, along with Upper Loch Roe and Loch an Tuirc, get some runs of sea trout and the occasional salmon. Although reports have been a bit patchy in recent years there has been a re-stocking programme and all are worth trying in the right conditions. The Trust tagged some smolts and any caught showing coloured dye behind the left eye must be reported to permit vendors, but any information on catches would be helpful.", "There are boats at all three lochs."], "lat_lng": " 58.170677, -5.245743"},
{"name": ["Loch Poll an Droighinn"], "description": ["Make Poll an Droighinn part of a day amongst Stoer's hill lochs.", "There are two ways in: Either head in as for Lexy's Loch and then go north up the hillside about half way along the northern shore; or head in along the Stoer peat track starting at NC040295 heading south at NC054295.", "Pollan Droighinn sits on top of the hillside with numerous islands and bays and lots of average sized trout.", "From here you can explore some of the unamed lochans which can have some excellent fish.", "Move on to try the two unnamed lochans to the north of the peat track, the easterly of which tends to get very weeded up; or move onto Loch na hi-Uidhe Doimhne."], "lat_lng": " 58.204840, -5.315269"},
{"name": ["Unnamed lochans near Clashnessie"], "description": ["A collection of small lochans an easy walk in from Clashnessie that make a great day out.", "The lochans vary in size and fruitfulness, but there are some giants among the hills along with lots of average sized fish.", "Park by Clashnessie Bay and follow the burn that runs SE/NW up from the road. There's a couple of old peat tracks, then cut across country and past another loch to get to this. Make it part of a day around the numerous lochans in this area.", "The large loch with prominentary has some big trout as well as lots of smaller ones and a couple of the smaller lochs nearby also hold good fish."], "lat_lng": " 58.222756, -5.282870"},
{"name": ["Unnamed lochans near Loch Crocach and Cnoc nan Caorach."], "description": ["There's a couple of lochs close together here with some very nice trout in them, usually very silver in colour and not easy to tempt, but worth it when you do!", "There's also a loch to the north nearer Crocach that has some nice fish among the lillies.", "Park at Rhicarn and follow the path as if going to Crocach. Just before reaching Crocach go through the deer fence and head east."], "lat_lng": " 58.184645, -5.226598"},
{"name": ["Lochan Sgeireach"], "description": ["An attractive roadside loch at the Clashnessie end of Stoer well worth a go (park at the northern end in the cut away, not in front of the houses). It reputedly had 3,000 sea trout fry put in a few years ago but is heavily fished given it's ease of access and can be dour, although you often see rises."], "lat_lng": " 58.208748, -5.337772"},
{"name": ["Loch Nan Lub"], "description": ["A long, meandering loch with numerous nooks, crannies and bays - and lots of small trout. Ideal for Assynt beginners, you get a sense of the remoteness and the maze of heather, rock and lochs!", "Start by walking up the Stoer peat track from NC040296, ignoring the two lochs nearby which are shallow and full of reeds. About a mile in, walk down to Loch an Easin and start fishing there, working along to Loch Nan Lub, keep moving and ultimately you reach Garbh Loch Beag (which has some larger fish).", "If you're having a long day out, drop down to Loch Poll Dhaidh or head north to the unnamed lochans north of Loch Nan Lub."], "lat_lng": " 58.217966, -5.294350"},
{"name": ["Loch Poll"], "description": ["The largest loch on the Crofter's estate, Loch Poll has trout of all sizes - from the usual half pounders to significantly larger fish. It is best fished from a boat which is located at ", " and boats tickets are available from the Drumbeg Hotel.", "It is also a boundary loch, as it neighbours another estate so be sure to check which areas are included and excluded before fishing."], "lat_lng": " 58.231977, -5.239408"},
{"name": ["Maiden Loch"], "description": ["A roadside loch on the B869 just before you reach Clahtoll from Lochinver.", "A good one for beginners or if you fancy a few casts once you have got down, with lots of average sized trout.", "Take care at the north west end which has power cables and head through to Loch na h-Airighe Bige.", "Otters have been seen here in recent years."], "lat_lng": " 58.184982, -5.318522"},
{"name": ["Loch Na Loinne"], "description": ["A beautiful, large loch and a stiff 3 mile walk in brings you to the heart of North Assynt.", "Lots and lots of fish, many very small, but also with fatter and larger trout. Fish in the margins all the way around except the steep wooded area on the south west shore. The southern side is reported as being best and you'll catch tiddlers by the bucket load near the inlet at the south eastern end.", "Water levels have been artificially raised in the last decade whcih has also helped the fishing."], "lat_lng": " 58.213257, -5.196838"},
{"name": ["Loch na hi-Uidhe Doimhne"], "description": ["Loch na hi-Uidhe Doimhne is a long, thin and in places deep loch that can be windswept and dour at times. It is a bit of a walk in - either from the Clachtoll peat track at NC044270 or from the Stoer peat track at NC040295 - and is best fished as part of a day among the myriad lochs here.", "Work along the north western shore and round the bays and the northern end of the loch is sometimes more productive. It can produce nice fish around the pound mark but also lots of smaller trout.", "Loch Poll Dhaidh, north east from the end of na hi-Uidhe Doimhne, is a large loch with lots of small, but beautiful trout and good for some sport if the day has been hard work. Don't ignore some of the shallower and smaller lochans around."], "lat_lng": " 58.203663, -5.291321"},
{"name": ["Loch na Bruthaich"], "description": ["Loch na Bruthaich is right next to the road on the way from Clashnessie to Strathcroy.  It is very little fished - and the stock shows evidence of this.  3-4oz fish leap onto a fly with an alarmingly suicidal tendency."], "lat_lng": " 58.228945, -5.286850"},
{"name": ["Loch Na Claise"], "description": ["Tucked away in the dip of Clashmore, a small loch with mostly small, average trout but worth a few casts.", "There is a boat available which makes the loch a much better prospect - especially under the cliff at the eastern edge and around the reed beds.", "It can get very reedy, especially later in the season, making it difficult to fish from the bank in some places and conditions.", " that the boat on this loch is not an ACT boat and is available to those staying at the Clashmore Holiday Cottages - please enquire there about use."], "lat_lng": " 58.221974, -5.347534"},
{"name": ["Loch Leathed aBhaile Fhoghair"], "description": ["Lexy's Loch is a beautiful loch that can be the starting point of a day up in Stoer's hill lochs, or a qucik visit in the morning or evening when it fishes better.", "Either park in Stoer and walk down the unmarked track that leads off the B869 by the cemetery, or drive down here about half a mile. You will reach the loch at its western edge and can fish right around the bays, drop offs and islands.", "Trout are mostly around the half pound mark and the southern side can be better, but harder to fish.", "Head on from here to Loch Poll an Droighinn, Lochan Dubh and Loch na h-Uidhe Doimhne"], "lat_lng": " 58.198431, -5.319778"},
{"name": ["Loch Drumbeg"], "description": ["Loch Drumbeg is a famous, large loch easily visible beside the B869 at Drumbeg. A beautiful location, there is a boat available and you can also fish much of the way around by bank. Although an easily accessible day's fishing, the far side from the road has lots of trees which can take a bit of negotiating. If on the boat try in and around the islands.\n", "\nThere are lots of trout, but they are mostly at the smaller end of the spectrum, but it can be prolific sport at times with top of the water action. "], "lat_lng": " 58.242764, -5.202905"},
{"name": ["Loch Donnaig"], "description": ["Loch Donnaig is a lovely quiet loch holding some decent sized fish (I've had several around the pound mark) and with a great view of the sea through a saddle.  Also look out for red deer here - they are often about.  As you drive from Clashnessie toward Drumbeg, there's a small parking space on the left just after the Strathcroy art studio."], "lat_lng": " 58.232159, -5.266699"},
{"name": ["Loch Cul Fraoich"], "description": ["A magical loch, especially in the evening or early morning - Cul Fraioch is difficult but rewarding. It can be very dour and even when 'on' the trout can be hard to catch. However, they are high quality, with deep pink flesh and there are some specimens of around 3lb caught every year.", "There is a boat located at the northern end (NC335023).", "Overcast days are best and often the evening is the time to head up here.", "Go through Culkein and park on the track that leads up to the loch, but beware of heading along the track as it can be diffficult to park and is rough in places."], "lat_lng": " 58.241252, -5.366398"},
{"name": ["Loch an Tuirc"], "description": ["This loch has some good trout fishing but also gets runs of sea trout. It is in a wonderful setting.", "Park at the side of the B869 by the turning for Rhicarn. This is a small space on the left heading towards Lochinver. Please do not park in the turning itself and do not block access. ", "Walk down the Rhicarn turning and past the houses. There is a very good path uphill which takes you all the way to Loch Crocach. When you near the loch, go through the deer fence and keep right on the Crocach peat track. ", "The ground can be quite boggy but follow the burn past Cnoc nan Caorach Beaga which is to the north. Proceed easterly to NC107258.", "There is a ", " available by clicking the ‘Boat Locations and Walking Route button in the right hand margin."], "lat_lng": " 58.180290, -5.221098"},
{"name": ["Loch an Aon Aite"], "description": ["If you want to really feel that sense of isolation, and to explore some rarely fished lochans, head in on the Clahtoll peat track at NC044270 for a good two and a half miles. Where the track peters out carry on heading east to find Loch an Aon Aite among a myriad of smaller lochans.", "This is a full day out and depending how long you have, there are at least 20 lochans around and to the east of Aon Aite to explore. Don't spend too long at any one, but there are rumoured to be some very good fish about."], "lat_lng": " 58.202438, -5.269074"},
{"name": ["Loch an Aigeil"], "description": [" Right next to the B869 in Stoer, on your right if you are heading north opposite Stoer Bay on your left. ", "It was for years reputed to have very few, if any, fish in it. However, there have been reports recently of decent trout being caught there.", " - ", "Very easily accessed. There isn’t a huge amount of fishable shoreline, but a nice spot for youngsters to cast a line and is close to the beach at Stoer."], "lat_lng": " 58.198032, -5.335063"},
{"name": ["Loch an Ordain"], "description": ["An easily accessible roadside loch, it has lots of small trout. Casting can be tricky as the bank is steep in places and it can get very reedy in later months.", "The small unnamed lochan to the north (NC067264) is worth atrying, reputedly holding some larger fish."], "lat_lng": " 58.180262, -5.292559"},
{"name": ["Loch Crocach"], "description": ["A wonderful setting half an hour up the path from Rhicarn on th B869. Crocach is a large loch, with lots of bays and islands to tempt the angler.", "There are large numbers of quick rising fish in the loch, but most are pretty small with the odd pounder landed. Drift down the loch and fish amongst the islands or fish from the bank along the southern shore.", "There are a number of smaller unnamed lochans to the south and south west that are also well worth trying."], "lat_lng": " 58.185068, -5.245355"},
{"name": ["Gorm Loch Mor"], "description": ["Up in the hills behind Nedd, your best access to this large loch is to take the track heading south from Nedd at NC137319, being careful not to block access for other cars.", "At the end of the track is a house and small byre. Proceed due south and then through a cutting between Cnoc Odhar and Cnoc Cailleach Iain which brings you out overlooking Gorm Loch Mor.", "There are fish of all sizes here and some good sport to be had with the south/south western shore offfering the easiest casting.", "Three quarters of the way along head south to the right of Gorm Chnoc, which looms over the end of Gorm Loch Mor, to Gorm Loch Beag. You can fish all the way around this loch and it has lots of trout between half and three quarters of a pound, as well as reputedly some larger specimens.", "There is a boat on Gorm Loch Mor which you can locate via the botton on the right."], "lat_lng": " 58.223800, -5.170530"},
{"name": ["Loch aBhraighe"], "description": ["Loch a'Bhraighe and Loch Torr na h-Eigin to its west are two large, joined lochs offering great sport in breathtaking surroundings. Not much by way of recent reports, so please let us know your catches.", "Loch a'Bhraighe has a boat which is a distinct advantage in covering the large water.", "Access is as for Lochan Fearna and Gorm Loch Mor from the track in Nedd and it is easy casting most of the way around, although the south eastern edge of Loch a'Bhraighe is very steep - try here from the boat.", "Pop over to loch Torr nan Uidhean if you have time. AVOID WADING in these lochs as there are some very steep drops!"], "lat_lng": " 58.226921, -5.189549"}
]